[ReStartName]
;守护进程名称
Text=restarta
[RuntimerName]
;后台进程名称
Text=YouEyERunTimea
[UI]
;界面标题
FormTitle=单无相机Chart界面
;是否是单相机界面
IsSignleCamera=False
;是否可以打开多个exe软件
IsMoreYouEyEExe=False
;设置当前运行界面，
;1_T_N1_H=单无相机图表界面-横向，1_C_N1_H=单无相机Chart界面-横向，
;1_T_N1=单无相机图表界面，1_C_N1=单无相机Chart界面，
;1_T_Camera1=海康/凌云单相机图表界面，1_C_Camera1=海康单相机Chart界面，
;1_T_BV1=凌云单相机图表界面，1_C_BV1=凌云单相机Chart界面，
;2_T_N2=双无相机图表界面，2_C_N2=双无相机Chart界面，
;2_T_Camera2=海康/凌云双相机图表界面，2_C_Camera2=海康/凌云双相机Chart界面，
;2_T_Camera1_N1=海康/凌云双相机图表界面-海康/凌云1-无相机1，2_C_Camera1_N1=海康/凌云双相机Chart界面-海康/凌云1-无相机1，
;2_T_BV2=BV双相机图表界面，2_C_BV2=BV双相机Chart界面，
;4_T_Camera2_N2=4相机图表界面-海康/凌云2-无相机2，4_C_Camera2_N2=4相机Chart界面-海康/凌云2-无相机2，
;4_T_Camera3_N1=4相机图表界面-海康/凌云3-无相机1，4_C_Camera3_N1=4相机Chart界面-海康/凌云3-无相机1，
;4_T_Camera1_N3=4相机图表界面-海康/凌云1-无相机3, 4_C_Camera1_N3=4相机Chart界面-海康/凌云1-无相机3,
;4_T_N4=4相机图表界面-无相机4, 4_C_N4=4相机Chart界面-无相机4
;3_T_N3=3相机图表界面-无相机4, 3_C_N3=3相机Chart界面-无相机3
;定制界面：YCLJ=定制单无相机Chart界面-银川隆基，
YouEyEExeIndex=3_T_N3
[MYUI1]
;是否启动报警
IsReportPolice1=False
;统计标题字体大小
TitalFontSize1=21.75
;统计数据标题字体大小
CountFontSize1=15
;图表标题字体大小
TableHeaderFontSize=12
;图表内容字体大小
TableCountFontSize=12
;Chart内容字体大小
ChartCountFontSize=12
;小图在界面列表上最多显示的数量
PictureCount1=10
ChartCountFontSize1=12
TableHeaderFontSize1=12
TableCountFontSize1=11
[Redis1]
;Redis端口号
RedisPort1=6379
;RedisIP地址
RedisIP1=127.0.0.1
[Redis2]
RedisPort2=6380
[Redis3]
RedisPort3=6381
[Redis4]
RedisPort4=6382
[HL1]
;Halcon端口号
HLPort1=9996
[HL2]
HLPort2=9997
[HL3]
HLPort3=9998
[HL4]
HLPort4=9999
[MySQL1]
;查询的结果的条件 格式例如 ：*OK*_*A*_*B*
QueryOK1=*OK*
;数据库是否更新
IsMySQLUpdate1=False
;数据库名称
DatabaseName1=a_XmartSQL
UpdateParam1=True
[MySQL2]
QueryOK2=*OK*
IsMySQLUpdate2=False
;数据库名称
DatabaseName2=b_XmartSQL
UpdateParam2=True
[MySQL3]
QueryOK3=*OK*
IsMySQLUpdate3=False
;数据库名称
DatabaseName3=c_XmartSQL
UpdateParam3=True
[MySQL4]
QueryOK4=*OK*
IsMySQLUpdate4=False
;数据库名称
DatabaseName4=d_XmartSQL
UpdateParam4=True
[UDP1]
;我方UDPIP地址
UDPBindIP1=127.0.0.1
;我方UDP端口号
UDPBindPort1=8001
;对方UDPIP地址
UDPIP1=127.0.0.1
;对方UDP端口号
UDPPort1=8000
;是否绑定我方UDP地址和端口号
IsUDPBind1=True
;通信防抖毫秒
FDMSec=600
[UDP2]
UDPBindIP2=127.0.0.1
UDPBindPort2=8002
UDPIP2=127.0.0.1
UDPPort2=8200
IsUDPBind2=True
[UDP3]
UDPBindIP3=127.0.0.1
UDPBindPort3=8003
UDPIP3=127.0.0.1
UDPPort3=8300
IsUDPBind3=True
[UDP4]
UDPBindIP4=127.0.0.1
UDPBindPort4=8004
UDPIP4=127.0.0.1
UDPPort4=8400
IsUDPBind4=True
[MYCamera1]
;相机名称
ManufacturerName1=A
;相机主图是否填充
IsPictureStretch1=True
;是否软触发
IsDelayed1=False
;软触发延时毫秒
DelayedTime1=0
;画图区域外扩
GraphicsKUO1=0
;原图保存类型 1=.tif,2=.jpg,3=.bmp,4=.png
SrcPicType1=1
;标记图保存类型 1=.tif,2=.jpg,3=.bmp,4=.png
BigPicType1=2
;小图保存类型 1=.tif,2=.jpg,3=.bmp,4=.png
SimPicType1=2
;特殊图保存类型 1=.tif,2=.jpg,3=.bmp,4=.png
OrPicType1=2
;是否存储原图
IsSavePicOK1=True
;是否存储原图
IsSaveSrcPic1=True
;是否存储标记图
IsSaveBigPic1=True
;是否存储小图
IsSaveSimPic1=True
;是否存储特殊图
IsSaveOrPic1=True
;标记图文字高度
BigAddHeight1=60
;小图文字高度
SimAddHeight1=25
HalconTimeOut1=500
PictureCount1=10
IsReportPolice1=False
[MYCamera2]
ManufacturerName2=192.168.7.10
IsPictureStretch2=True
IsReportPolice2=False
PictureCount2=10
BigPicType2=1
SimAddHeight2=25
SimPicType2=1
GraphicsKUO2=True
IsSaveSimPic2=True
SrcPicType2=1
IsSavePicOK2=True
IsSaveOrPic2=True
IsSaveSrcPic2=True
IsSaveBigPic2=True
OrPicType2=1
DelayedTime2=A
IsDelayed2=True
[MYCamera3]
ManufacturerName3=B
IsPictureStretch3=True
IsReportPolice3=False
PictureCount3=10
BigPicType3=1
SimAddHeight3=25
SimPicType3=1
GraphicsKUO3=True
IsSaveSimPic3=True
SrcPicType3=1
IsSavePicOK3=True
IsSaveOrPic3=True
IsSaveSrcPic3=True
IsSaveBigPic3=True
OrPicType3=1
DelayedTime3=A
IsDelayed3=True
[MYCamera4]
ManufacturerName4=192.168.8.9
IsPictureStretch4=True
IsReportPolice4=False
PictureCount4=10
[DeletePic1]
;是否自动删图
IsAutoDeletePic1=True
;删图类型
DeletePicType1=1
;删图种类
DeletePicKind1=1
;删图保留
DeletePicSave1=4
[MVSParams1]
MVSExposureTime1=3000
MVSGain1=15.0
MVSFrameRate1=4.8
[MYUI2]
TitalFontSize2=21.75
CountFontSize2=12
TableCountFontSize2=11
TableHeaderFontSize2=12
[MYUI3]
TitalFontSize3=21.75
CountFontSize3=12
TableCountFontSize3=11
TableHeaderFontSize3=12
[MYUI4]
TitalFontSize4=21.75
CountFontSize4=12
TableCountFontSize4=11
TableHeaderFontSize4=12
[MYUI0]
CountFontSize0=12
TableCountFontSize0=21.75
TitalFontSize0=11
[MYCamera0]
IsReportPolice0=False
PictureCount0=10
BigPicType0=1
SimAddHeight0=25
SimPicType0=1
GraphicsKUO0=True
IsSaveSimPic0=True
SrcPicType0=1
IsSavePicOK0=True
IsSaveOrPic0=True
IsSaveSrcPic0=True
IsSaveBigPic0=True
OrPicType0=1
ManufacturerName0=A
DelayedTime0=A
IsDelayed0=True
[UDP0]
UDPBindPort0=8000
UDPPort0=8000
UDPBindIP0=8000
[Redis0]
RedisPort0=6379
[DeletePic0]
DeletePicKind0=1
DeletePicType0=1
IsAutoDeletePic0=True
DeletePicSave0=4
[MySQL0]
QueryOK0=*OK*
UpdateParam0=True
[DeletePic2]
DeletePicKind2=1
DeletePicType2=1
IsAutoDeletePic2=True
DeletePicSave2=4
[DeletePic3]
DeletePicKind3=1
DeletePicType3=1
IsAutoDeletePic3=True
DeletePicSave3=4
